feat: change ascii graph to mermaid
